{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"conv_lstm1d_3_input": {"name": "conv_lstm1d_3_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "86520"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/time", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "56"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "14"}, {"size": "56"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/time_distributed_6/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "8"}, {"size": "14"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/time_distributed_5/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "8"}]}}}}}, {"name": "conv_lstm1d_3_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose", "op": "Transpose", "input": ["conv_lstm1d_3_input", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/zeros_like", "op": "ZerosLike", "input": ["conv_lstm1d_3_input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/zeros_like", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_counter", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/maximum_iterations", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_24", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_26", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopControlInputs/_27"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yL2NvbnZfbHN0bTFkXzMvd2hpbGU="}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_19", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_58"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_21", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_60"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_20", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_59"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_23", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_62"], "attr": {"_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_22", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_61"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_18", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_16", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_55"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_17", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/next_iteration/_56"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/cond/_14/sequential_2/conv_lstm1d_3/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_30", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_34", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_35", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_24", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_25", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_26", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_28", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_29", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_31", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_32", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/cond/_14/sequential_2/conv_lstm1d_3/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_35", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_32", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_33", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_34", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_30", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_counter_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_28", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/maximum_iterations_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_29", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/merge/_31", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/LoopCond/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_53", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor_switch/_44"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze_switch/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice_switch/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time_switch/_39"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_counter_switch/_37"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_body_control/_45", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_counter_switch/_37:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/maximum_iterations_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1_switch/_40"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor_switch/_44", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1_switch/_40", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze_switch/_41", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze_switch/_42", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice_switch/_43", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time_switch/_39", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_body_control/_45", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/maximum_iterations_switch/_38", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_24", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_25", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_26"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/exit/_49", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_3/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_3/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_24"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_7/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_7/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/Const_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/Const_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/clip_by_value_2/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/clip_by_value_2/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_1/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_1/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_24"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_5/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_5/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/Const_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/clip_by_value_1/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/clip_by_value_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_24"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_4/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_4/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_2/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_2/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_24"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input/_179", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze_switch/_41:1", "^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_6/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/convolution_6/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input/_177", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time_switch/_39:1", "^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/add_8/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/add_9/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/split_2-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_26"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/split_2-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_26"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/split_2-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/input_control_node/_174", "^StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/enter/_26"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/body/_15/sequential_2/conv_lstm1d_3/while/split_2-folded-2", "op": "Const", "input": 