{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"conv_lstm1d_input": {"name": "conv_lstm1d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "8"}, {"size": "14"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/time_distributed_3/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "32"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/time_distributed_4/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "14"}, {"size": "56"}]}}}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "86520"}, {"size": "9"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_lstm1d_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/zeros_like", "op": "ZerosLike", "input": ["conv_lstm1d_input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose", "op": "Transpose", "input": ["conv_lstm1d_input", "StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/zeros_like", "StatefulPartitionedCall/sequential_1/conv_lstm1d/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose", "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/Sum", "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/Shape", "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice/stack", "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/ExpandDims", "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/while/loop_counter", "StatefulPartitionedCall/sequential_1/conv_lstm1d/while/maximum_iterations", "StatefulPartitionedCall/sequential_1/conv_lstm1d/time", "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/Squeeze", "StatefulPartitionedCall/sequential_1/conv_lstm1d/convolution/Squeeze", "StatefulPartitionedCall/sequential_1/conv_lstm1d/strided_slice", "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}, {"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "1"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "4"}, {"size": "16"}]}, {"dim": [{"size": "16"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "_num_original_outputs": {"i": "11"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_lower_using_switch_merge": {"b": false}, "body": {"func": {"name": "__inference_sequential_1_conv_lstm1d_while_body_1303_frozen_27162"}}, "cond": {"func": {"name": "__inference_sequential_1_conv_lstm1d_while_cond_1302_frozen_27159"}}, "_stateful_parallelism": {"b": false}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/while:3", "StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d/transpose_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/time_distributed_3/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/sequential_1/time_distributed_3/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_1/time_distributed_3/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/time_distributed_3/Reshape_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/zeros_like", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/Sum", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/Shape", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/ExpandDims", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/while/loop_counter", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/while/maximum_iterations", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/time", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/Squeeze", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/convolution/Squeeze", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/strided_slice", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayUnstack/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"parallel_iterations": {"i": "32"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "828"}, {"size": "8"}]}, {"dim": [{"size": "-1"}, {"size": "828"}, {"size": "8"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "4"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "8"}, {"size": "32"}]}, {"dim": [{"size": "32"}]}]}}, "body": {"func": {"name": "__inference_sequential_1_conv_lstm1d_1_while_body_1626_frozen_27163"}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "_stateful_parallelism": {"b": false}, "_has_manual_control_dependencies": {"b": true}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "cond": {"func": {"name": "__inference_sequential_1_conv_lstm1d_1_while_cond_1625_frozen_27160"}}, "_num_original_outputs": {"i": "11"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/while:3", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_1/transpose_1"], "attr": {"strides": {"list": {"i": ["1", "1", "2", "1"]}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/time_distributed_4/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/sequential_1/time_distributed_4/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_1/time_distributed_4/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/time_distributed_4/Reshape_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/zeros_like", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/Sum", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/Shape", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice/stack", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/ExpandDims", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/while/loop_counter", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/while/maximum_iterations", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/time", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2_1", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/Squeeze", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/convolution/Squeeze", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/strided_slice", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayUnstack/TensorListFromTensor", "unknown_5", "unknown_6", "unknown_7"], "attr": {"body": {"func": {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158"}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "cond": {"func": {"name": "__inference_sequential_1_conv_lstm1d_2_while_cond_1948_frozen_27161"}}, "_has_manual_control_dependencies": {"b": true}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "_num_original_outputs": {"i": "11"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}, {"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "8"}, {"size": "56"}]}, {"dim": [{"size": "3"}, {"size": "14"}, {"size": "56"}]}, {"dim": [{"size": "56"}]}]}}, "parallel_iterations": {"i": "32"}, "_stateful_parallelism": {"b": false}, "_lower_using_switch_merge": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/while:3", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv_lstm1d_2/transpose_1"], "attr": {"ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/sequential_1/flatten_1/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_3/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_1_conv_lstm1d_2_while_cond_1948_frozen_27161", "inputArg": [{"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_less_sequential_1_conv_lstm1d_2_strided_slice", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_cond_1948___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_cond_1948___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_cond_1948___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_cond_1948___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_1_conv_lstm1d_2_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential_1/conv_lstm1d_2/while/Less", "op": "Less", "input": ["sequential_1_conv_lstm1d_2_while_placeholder", "sequential_1_conv_lstm1d_2_while_less_sequential_1_conv_lstm1d_2_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_1_conv_lstm1d_2_while_identity": "sequential_1/conv_lstm1d_2/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}]}}}}}}, {"signature": {"name": "__inference_sequential_1_conv_lstm1d_while_cond_1302_frozen_27159", "inputArg": [{"name": "sequential_1_conv_lstm1d_while_sequential_1_conv_lstm1d_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_while_sequential_1_conv_lstm1d_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_while_less_sequential_1_conv_lstm1d_strided_slice", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_while_sequential_1_conv_lstm1d_while_cond_1302___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_while_sequential_1_conv_lstm1d_while_cond_1302___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_while_sequential_1_conv_lstm1d_while_cond_1302___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_while_sequential_1_conv_lstm1d_while_cond_1302___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_1_conv_lstm1d_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential_1/conv_lstm1d/while/Less", "op": "Less", "input": ["sequential_1_conv_lstm1d_while_placeholder", "sequential_1_conv_lstm1d_while_less_sequential_1_conv_lstm1d_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_1_conv_lstm1d_while_identity": "sequential_1/conv_lstm1d/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158", "inputArg": [{"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_strided_slice_0", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_tensorarrayv2read_tensorlistgetitem_sequential_1_conv_lstm1d_2_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_2_while_split_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_split_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_split_2_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_1_conv_lstm1d_2_while_identity", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_2_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_sequential_1_conv_lstm1d_2_strided_slice", "type": "DT_INT32"}, {"name": "sequential_1_conv_lstm1d_2_while_tensorarrayv2read_tensorlistgetitem_sequential_1_conv_lstm1d_2_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_1_conv_lstm1d_2_while_split_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_split_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_1_conv_lstm1d_2_while_split_2_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential_1/conv_lstm1d_2/while/split/ReadVariableOp", "sequential_1/conv_lstm1d_2/while/split_1/ReadVariableOp", "sequential_1/conv_lstm1d_2/while/split_2/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/add_8/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_3/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_7/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_7/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/Const_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/Const_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/clip_by_value_2/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/clip_by_value_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_1/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_1/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_5/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/clip_by_value_1/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/clip_by_value_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_4/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_2/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/convolution_2/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/split_2/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_conv_lstm1d_2_while_body_1949_frozen_27158/sequential_1/conv_lstm1d_2/while/ones_like/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": 