{"format": "graph-model", "generatedBy": "2.9.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"conv_lstm1d_32_input": {"name": "conv_lstm1d_32_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}}, "outputs": {"dense_8": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "14"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "8"}, {"size": "14"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "16"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/time_distributed_24/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "32"}]}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "32"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/time_distributed_25/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "56"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "14"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/time_distributed_26/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "14"}, {"size": "64"}]}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/flatten_8/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_8/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48960"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}}, {"name": "conv_lstm1d_32_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/zeros_like", "op": "ZerosLike", "input": ["conv_lstm1d_32_input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose", "op": "Transpose", "input": ["conv_lstm1d_32_input", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/zeros_like", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/Sum", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/Shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice/stack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice/stack_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/ExpandDims", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/while/loop_counter", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/while/maximum_iterations", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/time", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/strided_slice", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"_num_original_outputs": {"i": "11"}, "body": {"func": {"name": "__inference_sequential_8_conv_lstm1d_32_while_body_1641_frozen_36116"}}, "parallel_iterations": {"i": "32"}, "_stateful_parallelism": {"b": false}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "_lower_using_switch_merge": {"b": false}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}, {"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "1"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "4"}, {"size": "16"}]}, {"dim": [{"size": "16"}]}]}}, "cond": {"func": {"name": "__inference_sequential_8_conv_lstm1d_32_while_cond_1640_frozen_36121"}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/while:3", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/max_pooling2d_32/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_32/transpose_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_8/time_distributed_24/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_8/max_pooling2d_32/MaxPool", "StatefulPartitionedCall/sequential_8/time_distributed_24/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_8/time_distributed_24/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_8/time_distributed_24/Reshape_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/zeros_like", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/Sum", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/Shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice/stack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice/stack_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/ExpandDims", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/while/loop_counter", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/while/maximum_iterations", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/time", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/strided_slice", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayUnstack/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"cond": {"func": {"name": "__inference_sequential_8_conv_lstm1d_33_while_cond_1963_frozen_36120"}}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "parallel_iterations": {"i": "32"}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "11"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "828"}, {"size": "8"}]}, {"dim": [{"size": "-1"}, {"size": "828"}, {"size": "8"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "4"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "8"}, {"size": "32"}]}, {"dim": [{"size": "32"}]}]}}, "_stateful_parallelism": {"b": false}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_sequential_8_conv_lstm1d_33_while_body_1964_frozen_36119"}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/while:3", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/max_pooling2d_33/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_33/transpose_1"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_8/time_distributed_25/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_8/max_pooling2d_33/MaxPool", "StatefulPartitionedCall/sequential_8/time_distributed_25/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_8/time_distributed_25/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_8/time_distributed_25/Reshape_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/zeros_like", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/Sum", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/Shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice/stack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice/stack_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/ExpandDims", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/while/loop_counter", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/while/maximum_iterations", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/time", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/strided_slice", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayUnstack/TensorListFromTensor", "unknown_5", "unknown_6", "unknown_7"], "attr": {"_stateful_parallelism": {"b": false}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}, {"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "8"}, {"size": "56"}]}, {"dim": [{"size": "3"}, {"size": "14"}, {"size": "56"}]}, {"dim": [{"size": "56"}]}]}}, "_num_original_outputs": {"i": "11"}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "cond": {"func": {"name": "__inference_sequential_8_conv_lstm1d_34_while_cond_2286_frozen_36118"}}, "parallel_iterations": {"i": "32"}, "body": {"func": {"name": "__inference_sequential_8_conv_lstm1d_34_while_body_2287_frozen_36117"}}, "_lower_using_switch_merge": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/while:3", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/max_pooling2d_34/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_34/transpose_1"], "attr": {"strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_8/time_distributed_26/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_8/max_pooling2d_34/MaxPool", "StatefulPartitionedCall/sequential_8/time_distributed_26/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_8/time_distributed_26/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_8/time_distributed_26/Reshape_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/zeros_like", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/Sum", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/Shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice/stack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice/stack_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/ExpandDims", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/while/loop_counter", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/while/maximum_iterations", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/time", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2_1", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/convolution/Squeeze", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/strided_slice", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayUnstack/TensorListFromTensor", "unknown_8", "unknown_9", "unknown_10"], "attr": {"T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_lower_using_switch_merge": {"b": false}, "_stateful_parallelism": {"b": false}, "_num_original_outputs": {"i": "11"}, "body": {"func": {"name": "__inference_sequential_8_conv_lstm1d_35_while_body_2610_frozen_36115"}}, "cond": {"func": {"name": "__inference_sequential_8_conv_lstm1d_35_while_cond_2609_frozen_36114"}}, "parallel_iterations": {"i": "32"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "204"}, {"size": "16"}]}, {"dim": [{"size": "-1"}, {"size": "204"}, {"size": "16"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "14"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "16"}, {"size": "64"}]}, {"dim": [{"size": "64"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/while:3", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_8/max_pooling2d_35/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_8/conv_lstm1d_35/transpose_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_8/flatten_8/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_8/max_pooling2d_35/MaxPool", "StatefulPartitionedCall/sequential_8/flatten_8/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_8/dense_8/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_8/flatten_8/Reshape", "StatefulPartitionedCall/sequential_8/dense_8/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_8/dense_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_8/dense_8/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_8/dense_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_8/dense_8/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_8_conv_lstm1d_35_while_cond_2609_frozen_36114", "inputArg": [{"name": "sequential_8_conv_lstm1d_35_while_sequential_8_conv_lstm1d_35_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_35_while_sequential_8_conv_lstm1d_35_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_35_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_35_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_8_conv_lstm1d_35_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_35_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_35_while_less_sequential_8_conv_lstm1d_35_strided_slice", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_35_while_sequential_8_conv_lstm1d_35_while_cond_2609___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_8_conv_lstm1d_35_while_sequential_8_conv_lstm1d_35_while_cond_2609___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_35_while_sequential_8_conv_lstm1d_35_while_cond_2609___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_35_while_sequential_8_conv_lstm1d_35_while_cond_2609___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_8_conv_lstm1d_35_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential_8/conv_lstm1d_35/while/Less", "op": "Less", "input": ["sequential_8_conv_lstm1d_35_while_placeholder", "sequential_8_conv_lstm1d_35_while_less_sequential_8_conv_lstm1d_35_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_8_conv_lstm1d_35_while_identity": "sequential_8/conv_lstm1d_35/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "204"}, {"size": "16"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "204"}, {"size": "16"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}}}, {"signature": {"name": "__inference_sequential_8_conv_lstm1d_33_while_body_1964_frozen_36119", "inputArg": [{"name": "sequential_8_conv_lstm1d_33_while_sequential_8_conv_lstm1d_33_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_33_while_sequential_8_conv_lstm1d_33_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_33_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_33_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_8_conv_lstm1d_33_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_33_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_33_while_sequential_8_conv_lstm1d_33_strided_slice_0", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_33_while_tensorarrayv2read_tensorlistgetitem_sequential_8_conv_lstm1d_33_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_8_conv_lstm1d_33_while_split_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_33_while_split_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_33_while_split_2_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_8_conv_lstm1d_33_while_identity", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_33_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_33_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_8_conv_lstm1d_33_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_8_conv_lstm1d_33_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_33_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_8_conv_lstm1d_33_while_sequential_8_conv_lstm1d_33_strided_slice", "type": 