{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"conv_lstm1d_3_input": {"name": "conv_lstm1d_3_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "8"}, {"size": "14"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "16"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/time_distributed_5/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "4"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "32"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/time_distributed_6/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "14"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "86520"}, {"size": "9"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}}, {"name": "conv_lstm1d_3_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "1662"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/zeros_like", "op": "ZerosLike", "input": ["conv_lstm1d_3_input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose", "op": "Transpose", "input": ["conv_lstm1d_3_input", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/zeros_like", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Sum", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/Shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/loop_counter", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while/maximum_iterations", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/time", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/convolution/Squeeze", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/strided_slice", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"_lower_using_switch_merge": {"b": false}, "_stateful_parallelism": {"b": false}, "_num_original_outputs": {"i": "11"}, "parallel_iterations": {"i": "32"}, "body": {"func": {"name": "__inference_sequential_2_conv_lstm1d_3_while_body_2504_frozen_12869"}}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "_has_manual_control_dependencies": {"b": true}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "cond": {"func": {"name": "__inference_sequential_2_conv_lstm1d_3_while_cond_2503_frozen_12864"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}, {"dim": [{"size": "-1"}, {"size": "1660"}, {"size": "4"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "1"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "4"}, {"size": "16"}]}, {"dim": [{"size": "16"}]}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/while:3", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_3/transpose_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/time_distributed_5/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/sequential_2/time_distributed_5/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_2/time_distributed_5/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/time_distributed_5/Reshape_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/zeros_like", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/Sum", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/Shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while/loop_counter", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while/maximum_iterations", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/time", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/Squeeze", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/convolution/Squeeze", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/strided_slice", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayUnstack/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"_num_original_outputs": {"i": "11"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_stateful_parallelism": {"b": false}, "_lower_using_switch_merge": {"b": false}, "_has_manual_control_dependencies": {"b": true}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "parallel_iterations": {"i": "32"}, "body": {"func": {"name": "__inference_sequential_2_conv_lstm1d_4_while_body_2827_frozen_12866"}}, "cond": {"func": {"name": "__inference_sequential_2_conv_lstm1d_4_while_cond_2826_frozen_12867"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "828"}, {"size": "8"}]}, {"dim": [{"size": "-1"}, {"size": "828"}, {"size": "8"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "4"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "8"}, {"size": "32"}]}, {"dim": [{"size": "32"}]}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/while:3", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling2d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_4/transpose_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_2/time_distributed_6/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2/max_pooling2d_5/MaxPool", "StatefulPartitionedCall/sequential_2/time_distributed_6/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_2/time_distributed_6/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/time_distributed_6/Reshape_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/zeros_like", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/Sum", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/Shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while/loop_counter", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while/maximum_iterations", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/time", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2_1", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/Squeeze", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/convolution/Squeeze", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/strided_slice", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayUnstack/TensorListFromTensor", "unknown_5", "unknown_6", "unknown_7"], "attr": {"T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}, {"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}, {}, {}, {"dim": [{"size": "3"}, {"size": "8"}, {"size": "56"}]}, {"dim": [{"size": "3"}, {"size": "14"}, {"size": "56"}]}, {"dim": [{"size": "56"}]}]}}, "cond": {"func": {"name": "__inference_sequential_2_conv_lstm1d_5_while_cond_3149_frozen_12865"}}, "_stateful_parallelism": {"b": false}, "body": {"func": {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868"}}, "parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "11"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/while:3", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/max_pooling2d_6/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2/conv_lstm1d_5/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2/max_pooling2d_6/MaxPool", "StatefulPartitionedCall/sequential_2/flatten_2/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/flatten_2/Reshape", "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_2/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_3/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_2_conv_lstm1d_5_while_cond_3149_frozen_12865", "inputArg": [{"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_less_sequential_2_conv_lstm1d_5_strided_slice", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_cond_3149___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_cond_3149___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_cond_3149___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_cond_3149___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_2_conv_lstm1d_5_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential_2/conv_lstm1d_5/while/Less", "op": "Less", "input": ["sequential_2_conv_lstm1d_5_while_placeholder", "sequential_2_conv_lstm1d_5_while_less_sequential_2_conv_lstm1d_5_strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_2_conv_lstm1d_5_while_identity": "sequential_2/conv_lstm1d_5/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "412"}, {"size": "14"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868", "inputArg": [{"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_strided_slice_0", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_tensorarrayv2read_tensorlistgetitem_sequential_2_conv_lstm1d_5_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_2_conv_lstm1d_5_while_split_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_split_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_split_2_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_2_conv_lstm1d_5_while_identity", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_2_conv_lstm1d_5_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_sequential_2_conv_lstm1d_5_strided_slice", "type": "DT_INT32"}, {"name": "sequential_2_conv_lstm1d_5_while_tensorarrayv2read_tensorlistgetitem_sequential_2_conv_lstm1d_5_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_2_conv_lstm1d_5_while_split_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_split_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_2_conv_lstm1d_5_while_split_2_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential_2/conv_lstm1d_5/while/split/ReadVariableOp", "sequential_2/conv_lstm1d_5/while/split_1/ReadVariableOp", "sequential_2/conv_lstm1d_5/while/split_2/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/add_8/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_3/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_7/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_7/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/Const_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/Const_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/clip_by_value_2/Minimum/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/clip_by_value_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_1/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_5/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/clip_by_value_1/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/clip_by_value_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_4/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_2/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_2/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/split_2/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/ones_like/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_6/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/split_1/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/convolution_6/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/add_9/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sequential_2/conv_lstm1d_5/while/ones_like/Shape", "op": "Shape", "input": ["sequential_2_conv_lstm1d_5_while_placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "sequential_2/conv_lstm1d_5/while/split/ReadVariableOp", "op": "Identity", "input": ["sequential_2_conv_lstm1d_5_while_split_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv_lstm1d_5/while/split_1/ReadVariableOp", "op": "Identity", "input": ["sequential_2_conv_lstm1d_5_while_split_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv_lstm1d_5/while/split_2/ReadVariableOp", "op": "Identity", "input": ["sequential_2_conv_lstm1d_5_while_split_2_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_2/conv_lstm1d_5/while/add_8", "op": "AddV2", "input": ["sequential_2_conv_lstm1d_5_while_placeholder", "__inference_sequential_2_conv_lstm1d_5_while_body_3150_frozen_12868/sequential_2/conv_lstm1d_5/while/add_8/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_2/conv_lstm1d_5/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_2_conv_lstm1d_5_while_tensorarrayv2read_tensorlistgetitem_sequential_2_conv_lstm1d_5_tensorarrayunstack_tensorlistfromtensor_0", 